transform half_size:
    zoom 0.5
    # xalign 0.0
    # yalign 1.0

define varna = Character('Варна', color="#000000", image="varna" )

image side varna = "varna.png"

transform change_transform(old, new):
    contains:
        old
        yalign 1.0
        xpos 0.0 xanchor 0.0
        linear 0.2 xanchor 1.0
    contains:
        new
        yalign 1.0
        xpos 0.0 xanchor 1.0
        linear 0.2 xanchor 0.0

define config.side_image_change_transform = change_transform

label start:
    scene forest
    
    play music "audio/forest_sounds.mp3" fadein 2.0 volume 0.1 loop

    varna "Отец наш небесный, дай мне сил, дай мне воли. Пусть рука моя не знает промаха, пусть сердце не знает жалости. Защити, Отец, от проклятий и ядов, от ведьминных взглядов, от морока и порока, от..."

    narrator "Варна прислушалась."

    narrator "Лес спал. Ветер не тревожил листву, твари не рыскали в траве, но воздух едва заметно подрагивал."

    # show varna at half_size with Dissolve(0.5)

    narrator "Пригнувшись, она прокралась вдоль охранного круга, выискивая глазами тотем-идол, поддерживающий его силу. Не то, не то, не то... Вот он!"

    menu:
        "Что делать дальше?"
        "Достать нож":
            varna "Отец наш небесный"
            narrator "Снова зашептала Варна, вынимая нож"
            varna "Дай мне сил, дай мне воли. Пусть рука моя не знает промаха, пусть сердце не знает жалости. Защити, Отец"
            narrator "Дышать Варне становилось все труднее"
            varna "От проклятий и ядов, от ведьминных взглядов, от морока и порока, от слова дурного, от..."
            narrator "Сжав в руке идола, она аккуратно вонзила в него блестящее в полумраке лезвие."
            narrator "На щербатой поверхности фигурки выступили густые капли темной крови. Её запах щекотал ноздри."

        "Убежать":
            narrator "Варна быстро убегает, оставляя за собой опасность."

label after_menu:
    scene witchhouse
    narrator "Дверь ведьминой избы приветливо распахнулась."
    varna "{i}Я могла бы войти прямо сейчас, не дожидаясь Дария, и столкнутся с ведьмой лицом к лицу.{/i}"
    varna "{i}Настолько ли я безрассудна? Да, можно не сомневаться.{/i}"
    narrator "Перешагнув через невидимую границу охранного круга, она подошла к избе и перепрыгнула через прогнившие ступени."
    play sound "audio/creaking.mp3" volume 0.5
    narrator "Доски жалобно скрипнули, прогнувшись под её весом"


return

